app/views/users/show.html.erb

SELECT `orders`.* FROM `orders` WHERE `orders`.`user_id` = 1
---
  	<tbody>
  	<% @user.orders.each do |order| %>