app/views/orders/_form.html.erb

SELECT `products`.* FROM `products` INNER JOIN `orders_products` ON `products`.`id` = `orders_products`.`product_id` WHERE `orders_products`.`order_id` = 1
---

  <%= select_tag "cate", options_from_collection_for_select(Product.all, 'id', 'prname',@order.products.map{ |j| j.id }), :multiple => true, class:'form-control'%>