app/controllers/orders_controller.rb

  def create

    @order = Order.new(order_params)
    @order.user_id = @user.id
    @product = Product.where(:id => params[:cate])
    @order.products<< @product
---
SELECT `products`.* FROM `products` WHERE `products`.`id` IN (1, 2)
INSERT INTO `orders` (`oid`, `oname`, `user_id`, `created_at`, `updated_at`) VALUES ('asd', 'asdad', 0, '2015-02-06 09:06:30.580435', '2015-02-06 09:06:30.580435')

  def update
    @order = Order.find(params[:id])
    @product = Product.where(:id => params[:cate])
    @order.products.destroy_all
    @order.products<< @product
    respond_to do |format|
      if @order.update(order_params)
---
SELECT  `orders`.* FROM `orders` WHERE `orders`.`id` = 1 LIMIT 1
SELECT `products`.* FROM `products` WHERE `products`.`id` IN (1, 2)
INSERT INTO `orders` (`oid`, `oname`, `created_at`, `updated_at`) VALUES ('1', 'o1', '2015-02-06 06:27:48.630146', '2015-02-06 06:27:48.630146')
UPDATE `orders` SET `address` = '55-2-3', `updated_at` = '2015-02-06 10:34:13.290806' WHERE `orders`.`id` = 7

  def destroy
    @order.destroy
---
DELETE FROM `orders` WHERE `orders`.`id` = 1