app/controllers/products_controller.rb

  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save
---
INSERT INTO `products` (`prid`, `prname`, `created_at`, `updated_at`) VALUES ('1', 'p1', '2015-02-06 06:25:44.555981', '2015-02-06 06:25:44.555981')